#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cmk_defaults.aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cmk/ebs"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.cmk_defaults.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days  = 30
      + description              = "CMK that will be used to encrypt all of the EBS goodness."
      + enable_key_rotation      = true
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::018907257838:root"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyOwnerPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                     = (known after apply)
    }

  # module.custom_policy.aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cmk/ebs"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.custom_policy.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "RSA_2048"
      + deletion_window_in_days  = 14
      + description              = "CMK that will be used to encrypt all of the EBS goodness."
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "SIGN_VERIFY"
      + policy                   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:RevokeGrant",
                          + "kms:ReEncrypt*",
                          + "kms:ListGrants",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::123456789101:root"
                        }
                      + Resource  = "*"
                      + Sid       = "CustomKeyPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                     = (known after apply)
    }

  # module.key_policy_condition.aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cmk/ebs"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.key_policy_condition.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days  = 30
      + description              = "CMK that will be used to encrypt all of the EBS goodness."
      + enable_key_rotation      = true
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::123456789101:root",
                              + "arn:aws:iam::109876543210:root",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "KeyOwnerPolicy"
                    },
                  + {
                      + Action    = [
                          + "kms:Update*",
                          + "kms:UntagResource",
                          + "kms:TagResource",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:Revoke*",
                          + "kms:Put*",
                          + "kms:List*",
                          + "kms:Get*",
                          + "kms:Enable*",
                          + "kms:Disable*",
                          + "kms:Describe*",
                          + "kms:Delete*",
                          + "kms:Create*",
                          + "kms:CancelKeyDeletion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::123456789101:user/TPol",
                              + "arn:aws:iam::123456789101:role/KMS-KeyPolicy-Admins",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "KeyAdminPolicy"
                    },
                  + {
                      + Action    = [
                          + "kms:RevokeGrant",
                          + "kms:ListGrants",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + Bool = {
                              + kms:GrantIsForAWSResource = [
                                  + "true",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::123456789101:user/Spock",
                              + "arn:aws:iam::123456789101:user/Data",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "KeyGrantPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                     = (known after apply)
    }

  # module.key_policy_no_condition.aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cmk/ebs"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.key_policy_no_condition.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days  = 30
      + description              = "CMK that will be used to encrypt all of the EBS goodness."
      + enable_key_rotation      = true
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::018907257838:root"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyOwnerPolicy"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::123456789101:user/TPol"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyUserPolicy"
                    },
                  + {
                      + Action    = [
                          + "kms:RevokeGrant",
                          + "kms:ListGrants",
                          + "kms:CreateGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::123456789101:user/Spock",
                              + "arn:aws:iam::123456789101:user/Data",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "KeyGrantPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                     = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan`, Action: `hashicorpterraform-github-actions2`, Working Directory: `./example`, Workspace: `default`*
